---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures
source: html/6a1188d0-3cae-0e69-3469-3d1cb7fa6e8d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures

## Syntax (C#)
```csharp
public static class ExternalResourceReferenceFailures
```